---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralH.WallDesignThickness
source: html/5f919884-ff47-e898-e919-d4e5914df61c.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionGeneralH.WallDesignThickness Property

Represents wall design thickness of rectangle.

## Syntax (C#)
```csharp
public double WallDesignThickness { get; set; }
```

## Remarks
Design thickness of pipe wall is value should be thinner value than measured real value (nominal).